; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_16)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - person
	)

  (:init
		(= (x b0) -5)
(= (y b0) 0)
(= (x b1) -8)
(= (y b1) 0)
(= (x b2) -8)
(= (y b2) 0)
(= (x b3) -10)
(= (y b3) 0)
(= (x b4) -2)
(= (y b4) 0)
(= (x b5) -6)
(= (y b5) 0)
(= (x b6) 8)
(= (y b6) 0)
(= (x b7) -9)
(= (y b7) 0)
(= (x b8) -3)
(= (y b8) 0)
(= (x b9) 4)
(= (y b9) 0)
(= (x b10) -2)
(= (y b10) 0)
(= (x b11) 10)
(= (y b11) 0)
(= (x b12) -7)
(= (y b12) 0)

		(= (d p0) 35)
(= (d p1) 91)
(= (d p2) 97)
(= (d p3) 64)
(= (d p4) 63)
(= (d p5) 2)
(= (d p6) 20)
(= (d p7) 65)
(= (d p8) 59)
(= (d p9) 89)
(= (d p10) 74)
(= (d p11) 27)
(= (d p12) 31)
(= (d p13) 1)
(= (d p14) 72)
(= (d p15) 28)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
(saved p15)
		)
	)
)

; plan
1. (go_north_east b4)
   changed: (x b4) from -2 to -0.5, (y b4) from 0 to 1.5
   goals met: 0 of 16
2. (go_north_east b4)
   changed: (x b4) from -0.5 to 1, (y b4) from 1.5 to 3
   goals met: 0 of 16
3. (go_north_east b4)
   changed: (x b4) from 1 to 2.5, (y b4) from 3 to 4.5
   goals met: 0 of 16
4. (go_north_east b4)
   changed: (x b4) from 2.5 to 4, (y b4) from 4.5 to 6
   goals met: 0 of 16
5. (go_north_east b4)
   changed: (x b4) from 4 to 5.5, (y b4) from 6 to 7.5
   goals met: 0 of 16
6. (go_north_east b4)
   changed: (x b4) from 5.5 to 7, (y b4) from 7.5 to 9
   goals met: 0 of 16
7. (go_north_east b4)
   changed: (x b4) from 7 to 8.5, (y b4) from 9 to 10.5
   goals met: 0 of 16
8. (go_north_east b4)
   changed: (x b4) from 8.5 to 10, (y b4) from 10.5 to 12
   goals met: 0 of 16
9. (save_person b4 p5)
   added: (saved p5)
   goals met: 1 of 16
10. (save_person b4 p13)
   added: (saved p13)
   goals met: 2 of 16
11. (go_north_east b4)
   changed: (x b4) from 10 to 11.5, (y b4) from 12 to 13.5
   goals met: 2 of 16
12. (go_north_east b4)
   changed: (x b4) from 11.5 to 13, (y b4) from 13.5 to 15
   goals met: 2 of 16
13. (go_north_east b4)
   changed: (x b4) from 13 to 14.5, (y b4) from 15 to 16.5
   goals met: 2 of 16
14. (go_north_east b4)
   changed: (x b4) from 14.5 to 16, (y b4) from 16.5 to 18
   goals met: 2 of 16
15. (go_north_east b4)
   changed: (x b4) from 16 to 17.5, (y b4) from 18 to 19.5
   goals met: 2 of 16
16. (go_north_east b4)
   changed: (x b4) from 17.5 to 19, (y b4) from 19.5 to 21
   goals met: 2 of 16
17. (go_north_east b4)
   changed: (x b4) from 19 to 20.5, (y b4) from 21 to 22.5
   goals met: 2 of 16
18. (go_north_east b4)
   changed: (x b4) from 20.5 to 22, (y b4) from 22.5 to 24
   goals met: 2 of 16
19. (go_north_east b4)
   changed: (x b4) from 22 to 23.5, (y b4) from 24 to 25.5
   goals met: 2 of 16
20. (go_north_east b4)
   changed: (x b4) from 23.5 to 25, (y b4) from 25.5 to 27
   goals met: 2 of 16
21. (go_north_east b4)
   changed: (x b4) from 25 to 26.5, (y b4) from 27 to 28.5
   goals met: 2 of 16
22. (go_north_east b4)
   changed: (x b4) from 26.5 to 28, (y b4) from 28.5 to 30
   goals met: 2 of 16
23. (go_north_east b4)
   changed: (x b4) from 28 to 29.5, (y b4) from 30 to 31.5
   goals met: 2 of 16
24. (go_west b4)
   changed: (x b4) from 29.5 to 26.5
   goals met: 2 of 16
25. (go_west b4)
   changed: (x b4) from 26.5 to 23.5
   goals met: 2 of 16
26. (go_west b4)
   changed: (x b4) from 23.5 to 20.5
   goals met: 2 of 16
27. (go_west b4)
   changed: (x b4) from 20.5 to 17.5
   goals met: 2 of 16
28. (go_west b4)
   changed: (x b4) from 17.5 to 14.5
   goals met: 2 of 16
29. (go_west b4)
   changed: (x b4) from 14.5 to 11.5
   goals met: 2 of 16
30. (go_north_east b4)
   changed: (x b4) from 11.5 to 13, (y b4) from 31.5 to 33
   goals met: 2 of 16
31. (go_north_east b4)
   changed: (x b4) from 13 to 14.5, (y b4) from 33 to 34.5
   goals met: 2 of 16
32. (go_north_east b4)
   changed: (x b4) from 14.5 to 16, (y b4) from 34.5 to 36
   goals met: 2 of 16
33. (go_north_east b4)
   changed: (x b4) from 16 to 17.5, (y b4) from 36 to 37.5
   goals met: 2 of 16
34. (go_north_east b4)
   changed: (x b4) from 17.5 to 19, (y b4) from 37.5 to 39
   goals met: 2 of 16
35. (go_north_east b4)
   changed: (x b4) from 19 to 20.5, (y b4) from 39 to 40.5
   goals met: 2 of 16
36. (go_west b4)
   changed: (x b4) from 20.5 to 17.5
   goals met: 2 of 16
37. (go_west b4)
   changed: (x b4) from 17.5 to 14.5
   goals met: 2 of 16
38. (go_west b4)
   changed: (x b4) from 14.5 to 11.5
   goals met: 2 of 16
39. (save_person b4 p11)
   added: (saved p11)
   goals met: 3 of 16
40. (save_person b4 p15)
   added: (saved p15)
   goals met: 4 of 16
41. (go_west b4)
   changed: (x b4) from 11.5 to 8.5
   goals met: 4 of 16
42. (save_person b4 p12)
   added: (saved p12)
   goals met: 5 of 16
43. (go_north_west b4)
   changed: (x b4) from 8.5 to 7, (y b4) from 40.5 to 42
   goals met: 5 of 16
44. (save_person b4 p0)
   added: (saved p0)
   goals met: 6 of 16
45. (go_north_west b4)
   changed: (x b4) from 7 to 5.5, (y b4) from 42 to 43.5
   goals met: 6 of 16
46. (go_north_west b4)
   changed: (x b4) from 5.5 to 4, (y b4) from 43.5 to 45
   goals met: 6 of 16
47. (go_north_west b4)
   changed: (x b4) from 4 to 2.5, (y b4) from 45 to 46.5
   goals met: 6 of 16
48. (go_north_east b4)
   changed: (x b4) from 2.5 to 4, (y b4) from 46.5 to 48
   goals met: 6 of 16
49. (go_north_east b4)
   changed: (x b4) from 4 to 5.5, (y b4) from 48 to 49.5
   goals met: 6 of 16
50. (go_north_east b4)
   changed: (x b4) from 5.5 to 7, (y b4) from 49.5 to 51
   goals met: 6 of 16
51. (go_north_east b4)
   changed: (x b4) from 7 to 8.5, (y b4) from 51 to 52.5
   goals met: 6 of 16
52. (go_north_east b4)
   changed: (x b4) from 8.5 to 10, (y b4) from 52.5 to 54
   goals met: 6 of 16
53. (go_north_east b4)
   changed: (x b4) from 10 to 11.5, (y b4) from 54 to 55.5
   goals met: 6 of 16
54. (go_north_east b4)
   changed: (x b4) from 11.5 to 13, (y b4) from 55.5 to 57
   goals met: 6 of 16
55. (go_north_east b4)
   changed: (x b4) from 13 to 14.5, (y b4) from 57 to 58.5
   goals met: 6 of 16
56. (go_north_west b4)
   changed: (x b4) from 14.5 to 13, (y b4) from 58.5 to 60
   goals met: 6 of 16
57. (go_north_west b4)
   changed: (x b4) from 13 to 11.5, (y b4) from 60 to 61.5
   goals met: 6 of 16
58. (go_north_west b4)
   changed: (x b4) from 11.5 to 10, (y b4) from 61.5 to 63
   goals met: 6 of 16
59. (go_north_west b4)
   changed: (x b4) from 10 to 8.5, (y b4) from 63 to 64.5
   goals met: 6 of 16
60. (go_north_west b4)
   changed: (x b4) from 8.5 to 7, (y b4) from 64.5 to 66
   goals met: 6 of 16
61. (save_person b4 p8)
   added: (saved p8)
   goals met: 7 of 16
62. (go_north_west b4)
   changed: (x b4) from 7 to 5.5, (y b4) from 66 to 67.5
   goals met: 7 of 16
63. (go_north_west b4)
   changed: (x b4) from 5.5 to 4, (y b4) from 67.5 to 69
   goals met: 7 of 16
64. (save_person b4 p3)
   added: (saved p3)
   goals met: 8 of 16
65. (save_person b4 p4)
   added: (saved p4)
   goals met: 9 of 16
66. (save_person b4 p7)
   added: (saved p7)
   goals met: 10 of 16
67. (go_north_west b4)
   changed: (x b4) from 4 to 2.5, (y b4) from 69 to 70.5
   goals met: 10 of 16
68. (go_north_east b4)
   changed: (x b4) from 2.5 to 4, (y b4) from 70.5 to 72
   goals met: 10 of 16
69. (go_north_east b10)
   changed: (x b10) from -2 to -0.5, (y b10) from 0 to 1.5
   goals met: 10 of 16
70. (go_north_east b10)
   changed: (x b10) from -0.5 to 1, (y b10) from 1.5 to 3
   goals met: 10 of 16
71. (go_north_east b10)
   changed: (x b10) from 1 to 2.5, (y b10) from 3 to 4.5
   goals met: 10 of 16
72. (go_north_east b10)
   changed: (x b10) from 2.5 to 4, (y b10) from 4.5 to 6
   goals met: 10 of 16
73. (go_north_east b10)
   changed: (x b10) from 4 to 5.5, (y b10) from 6 to 7.5
   goals met: 10 of 16
74. (go_north_east b10)
   changed: (x b10) from 5.5 to 7, (y b10) from 7.5 to 9
   goals met: 10 of 16
75. (go_north_east b10)
   changed: (x b10) from 7 to 8.5, (y b10) from 9 to 10.5
   goals met: 10 of 16
76. (go_north_east b10)
   changed: (x b10) from 8.5 to 10, (y b10) from 10.5 to 12
   goals met: 10 of 16
77. (go_north_east b4)
   changed: (x b4) from 4 to 5.5, (y b4) from 72 to 73.5
   goals met: 10 of 16
78. (go_north_east b4)
   changed: (x b4) from 5.5 to 7, (y b4) from 73.5 to 75
   goals met: 10 of 16
79. (go_north_east b4)
   changed: (x b4) from 7 to 8.5, (y b4) from 75 to 76.5
   goals met: 10 of 16
80. (go_north_east b4)
   changed: (x b4) from 8.5 to 10, (y b4) from 76.5 to 78
   goals met: 10 of 16
81. (go_north_east b4)
   changed: (x b4) from 10 to 11.5, (y b4) from 78 to 79.5
   goals met: 10 of 16
82. (go_north_east b4)
   changed: (x b4) from 11.5 to 13, (y b4) from 79.5 to 81
   goals met: 10 of 16
83. (go_north_east b4)
   changed: (x b4) from 13 to 14.5, (y b4) from 81 to 82.5
   goals met: 10 of 16
84. (go_north_west b4)
   changed: (x b4) from 14.5 to 13, (y b4) from 82.5 to 84
   goals met: 10 of 16
85. (go_north_west b4)
   changed: (x b4) from 13 to 11.5, (y b4) from 84 to 85.5
   goals met: 10 of 16
86. (save_person b4 p10)
   added: (saved p10)
   goals met: 11 of 16
87. (save_person b4 p14)
   added: (saved p14)
   goals met: 12 of 16
88. (go_north_west b4)
   changed: (x b4) from 11.5 to 10, (y b4) from 85.5 to 87
   goals met: 12 of 16
89. (go_north_west b4)
   changed: (x b4) from 10 to 8.5, (y b4) from 87 to 88.5
   goals met: 12 of 16
90. (go_north_west b4)
   changed: (x b4) from 8.5 to 7, (y b4) from 88.5 to 90
   goals met: 12 of 16
91. (go_north_west b4)
   changed: (x b4) from 7 to 5.5, (y b4) from 90 to 91.5
   goals met: 12 of 16
92. (go_north_west b4)
   changed: (x b4) from 5.5 to 4, (y b4) from 91.5 to 93
   goals met: 12 of 16
93. (save_person b4 p9)
   added: (saved p9)
   goals met: 13 of 16
94. (go_north_west b4)
   changed: (x b4) from 4 to 2.5, (y b4) from 93 to 94.5
   goals met: 13 of 16
95. (save_person b4 p1)
   added: (saved p1)
   goals met: 14 of 16
96. (go_north_west b4)
   changed: (x b4) from 2.5 to 1, (y b4) from 94.5 to 96
   goals met: 14 of 16
97. (go_north_west b4)
   changed: (x b4) from 1 to -0.5, (y b4) from 96 to 97.5
   goals met: 14 of 16
98. (save_person b4 p2)
   added: (saved p2)
   goals met: 15 of 16
99. (go_north_west b10)
   changed: (x b10) from 10 to 8.5, (y b10) from 12 to 13.5
   goals met: 15 of 16
100. (go_north_west b10)
   changed: (x b10) from 8.5 to 7, (y b10) from 13.5 to 15
   goals met: 15 of 16
101. (go_north_west b10)
   changed: (x b10) from 7 to 5.5, (y b10) from 15 to 16.5
   goals met: 15 of 16
102. (go_north_west b10)
   changed: (x b10) from 5.5 to 4, (y b10) from 16.5 to 18
   goals met: 15 of 16
103. (go_north_west b10)
   changed: (x b10) from 4 to 2.5, (y b10) from 18 to 19.5
   goals met: 15 of 16
104. (go_north_west b10)
   changed: (x b10) from 2.5 to 1, (y b10) from 19.5 to 21
   goals met: 15 of 16
105. (save_person b10 p6)
   added: (saved p6)
   goals met: 16 of 16
